<?php
session_start();
include_once("config.php");
?>
<!DOCTYPE html>
<html>
<head>
    <title>Home</title>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1"> 
    <link rel="stylesheet" type="text/css" href="main.css"/>
    <link rel="stylesheet" type="text/css" href="article1.css"/>
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.4.1/css/bootstrap.min.css">
    <script src="main.js"></script>
</head>
<body style="background-color: rgb(228, 227, 237);">
    <div class="top">
        <marquee width = "75%">Заредете живота си със силата и мъдростта на всемогъщата вселена. Купете скъпоценни и полускъпоценни камъни, минерали и други дарове на земните стихии на най-изгодни цени. Голямото разнообразие, което предлагаме, ще покрие индивидуалните ви нужди. Минералите в своите многобройни цветове, форми и енергийни свойства ще ви донесат просперитет, здраве, красота, любов и баланс.</marquee>
        <img src="login.png" width="20">
        <a href="login.php" style="color:#05062a;" id="a1">Login</a> 
        <img src="register.png" width="25">
        <a href="register.php" style="color:#05062a;" id="a2">Register</a>
    </div>

    <div class="topnav"> 
        <img src="crystals.jpg" class="responsive" style="height:auto;">
        <a href="index.html" class="active">Начало</a>
        <a href="crystals.html">Кристали</a>
        <a href="minerals.html">Минерали</a>
        <a href="#market">Магазин</a> 
        <a href="astrology.html">Астрология</a> 
        <a href="blog.html">Блог</a>
        <a href="contact.html">Контакти</a>
    </div>
    <div class="m-nu">
        <div style="align-items: center;justify-content: center;">
          <h2 style="text-align: center;">Изчистване и програмиране на кристалите</h2>
            <br>
                <p style="font-size: 18px;">

                    За да подготвите кристала за лечение, той трябва първоначално да бъде почистен физически от кал, масла, пясък или други вещества и частици. След това, използвайки определена техника за почистане, се премахва всякаква негативна енергия от кристала. 
                
                    Възможно е кристалът да е поел някаква негативна енергия и използвайки го без да бъде почистен, рискуваме тази негативна енергия да се прехвърли върху нас или върху наш клиент.
                    
                    За да се използват максимално лечебните ефекти на кристала, е необходимо да се приложи „зареждане“ на кристала. Това ще му осигури подходящо електромагнитно поле и ще го „подхрани“ чрез насищане с ултравиолетова светлина. Тя действа тонизиращо на всеки кристал. За да може кристалът да изпълни своята роля и мисия е необходимо той да бъде „събуден“.
                    
                    Накрая, за да може енергията на кристала да се насочи към постигане на желания резултат, е необходимо той да бъде програмиран. Възможно е кристалът да се използва просто за подкрепа по време на лечебен сеанс.
                    <br>
                    <br>
                   <b> Физическо Почистване на Кристал</b>
                     <br>
                    <br>
                    Ако сте закупили кристал, върху който все още има пръст и скални отломъци, не се притеснявайте, тъй като те се част от матрицата на растежа на самия кристал. Матрицата е частта от земята, върху която израства кристалът и е пълна с минерални вещества, които го „подхранват“. Опитайте се първо, като използвате суха четка, да отстраните това, което можете, но бъдете внимателни, тъй като кристалът може да бъде по-мек от самата матрицата, в която е израстнал. След това използвайте топла водна баня и по-твърда почистващата четка за по-едрите кристали или гъвкава, средно-мека четка за зъби за по-крехките такива. Понякога може да използвате и силно пенлив препарат за миене на съдове и по-твърда четка за зъби, като с помощта на пяната да се почистят песъчинките и частиците от ъгълчетата. Матрицата на кварцовите кристали обикновено е жълта към каки и по-упоритите частици кал могат да бъдат отстранени чрез баня с оксалова киселина от 2 до 5 дни – разбира се, ако обикновеното измиване с вода не е подействало.
                  
                    Използвайте 1 част оксалова киселина и 2 части вода. Що се отнася до „нормалната“ кал, по-скоро използвайте топла вода, вана и / или струя под високо налягане, за да отмиете калта. Можете да почистите калта и с твърда дървена клечка.Не използвайте метални инструменти, тъй като най-вероятно те ще надраскат или счупят кристала, понеже стоманата е по-твърда, отколкото кристала. После оставете кристала да изсъхне на слънце и да „прихване“ от неговите лъчи!
                    <br>
                    <br>
                    <b> Енергиино Почистване на Кристал</b>
                    <br>
                    <br>
                    След като физически сте почистили кристала, следващата стъпка е да го почистите от нежеланите вибрации и енергии, дошли от хората, които са работили с кристала по време на неговото добиване, опаковане, транспортиране, разопаковане и показване, преди изобщо да е пристигнал при вас. Кристалите са склонни да поемат безразборно енергията и също като при носенето на чужда дреха, можете да почувствате, че енергията му не е точно вашата.
                    
                    Всички сме чели или чували, че най-подходящата техника за почистването на кристалите е като ги заровим в морска сол за период от няколко дни до няколко седмици. Просто усетете коя техника е за вас, коя ви звучи смислено и експериментирайте. Някои препоръчват използването на солна баня за кристали, които са в състояние да я понесат. Наистина солта е добро за премахване на негативните енергии от повечето кристали. Въпреки всичко, се съобразете с това, че някои кристали като Опалите, Лаписа, Пирита, Хематита и др. са чувствителни към солта и тяхната повърхност може много бързо да се повреди в солна баня.
                    
                    В случай че сте решили да използвате тази техника, имайте предвид, че кристалите не трябва да се държат накиснати много дълго в солената вода. Седем часа обикновено са достатъчни за тяхното почистване, освен ако кристалите са изключително замърсени поради някаква причина. Когато сте имали наистина тежко почистване на клиент (ниво екзорсизъм), тогава оставете кристалите в силно наситена солена вода в продължение на 3-4 дни или дори за по-дълго. При нормална ежедневна „употреба“ на кристали, като носенето им в джоб или на висулка и пр., лека 7-часова баня на всеки 2 седмици е достатъчна. За целта вземете пластмасова или стъклена купа достатъчно голяма, за да побере вашия кристал(и). Стъкленият съд е добър, но повърхността му е твърда и бихте могли по невнимание да счупите или пукнете вашите кристали. Напълнете купата с вода, така че тя да покрие кристалите с около 2-3 см. Добре е водата да е със стайна температура, а най-добре би било, ако използвате изворна вода, която е „жива“ и съдържа „хранителни вещества“, които кристали обичат. 
                    
                 
                    Може да използвате и дестилирана вода за почистване на по-финни енергии. За кристала точната температура на водата няма значение, освен ако не изпадате в крайности като използването на много гореща и много студена такава. След това, за всеки кристал, добавете 1 супена лъжица сол (ориентировъчно). „Перфектният“ разтвор за почистване е 30%-вият разтвор на морска сол в изворна вода, т.е. 30гр. морска сол в 100мл. изворна вода. Също, ако имате истинска морска вода, можете да я използвате! Обикновено, просто хвърлете шепа сол върху кристалите и оставете съда на слънце, за да се накиснат.
                    
                    Опитайте се да използвате махало, което ще ви помогне да определите кога кристалите са готови и могат да бъдат извадени от банята. Също така можете, минавайки покрай почистващите се кристали, да се опитате интуитивно да узнаете дали са „готови“. Когато изливате солената вода, внимавайте да не я докосвате, за да не прехвърлите негативните енергии върху себе си!  После не забравяйте обилно да изплакнете всеки кристал под течаща вода, за да отстраните остатъците от солената вода. Оставете кристалите върху хартия или кърпа за подсушаване.
                    
                
                    
                    Някои хора се питат дали има разлика между използването на морска сол и готварска сол (каменна сол). Да, има! Когато станете по-чувствителни към фините енергии сами ще я доловите. Морската сол оставя почистените кристали с по-различно усещане от готварската. Морска сол има по-фин енергиен „подпис“, с множество малки вибрации, оцветени с цветовете на дъгата. Трапезната сол е като впрегатен кон – не толкова изтънчен, по-тромав и притежава от по-тежките жълти и сиво-сини вибрации. Ако планирате да използвате кристали за по-горните чакри (3-то око или Коронна), почистете ги с морска сол, тъй като тези центрове са много фини и чувствителни към по-фини вибрации. Просто опитайте да накиснете два кристала – един в морска сол и друг в готварска сол. После ги изплакнете обилно и след това вижте дали ще можете да усетите енергийно разликата между тях.
                    
                    Друг популярен метод за почистване чрез сол е като напълните до половината стъклена или пластмасова купа с морска сол и поставете кристалите директно в солта. След това или досипете сол, за да ги затрупате или ги оставете така на повърхността. Отново трябва да ги оставите в солта поне за няколко часа, най добре е за една нощ или в продължение на няколко дни. После трябва да изплакнете кристали обилно под хладка течаща вода, за да премахнете всякаква останала по тях сол. След употребата на сол, тя се изхвърля и никога не се използват повторно! Иначе поставените кристали ще усвоят негативните и нежелани енергии от първоначалното почистване. При този метод също трябва да се съобразявате с видовете кристали, които поставяте директно върху сухата сол, за да няма неблагоприятен ефект върху тях, както е обяснено по-горе.
                    
                    Безконтактното почистване със сол се смята за най-сигурният метод за почистване със сол и се използва, когато искате да предпазите кристалите от увреждане при директен контакт със солта. 
                   
                    Добър метод, особено за почистване на скъпоценни камъни, поставени в бижута или някакъв метал. Първо, напълнете стъклена купа наловина или до две трети със суха морска сол. След това поставете по-малък стъклен съд или плитка чаша в купата и я заровете наполовина в солта. После можете да поставите вашите кристали директно в празната чаша, както си стои половината заровена в сухата сол. Солта ще бъде в състояние да изтегли запазените в камъните енергии, но този метод ще отнеме повече време, отколкото прекия контакт със солта. Можете също да налеете достатъчно вода (за предпочитане изворна, дестилирана или минерална вода) в малкия стъклен съд – достатъчно, за да покрие кристалите или бижутата. Това ще ги защити от прякото „полагане върху сол“ или „от соления въздух“, предизвикващи корозия или неблагоприятни последици за всички метали, обграждащи скъпоценните камъни. Също така, имайте предвид, че някои кристали не трябва да се оставят или да се накисват във вода, напр. селенит. Отново използваната сол трябва да бъде изхвърлена и никога да не се използва повторно!
                    
                   
                    Всички кристали могат да се почистват безопасно, когато ги поставите върху друза от Аметистза една нощ или за 24-48 часа. Кварцовата друза може да се използва по същия начин. Чистият и бистър кварц осъществява този процес на прочистване по-бързо, отколкото Аметиста, но и двата метода са еднакво ефективни. Просто поставетене повече от няколко кристала върху кристалните връхчета на друзата и ги оставете така за 24 до 48 часа. Тези друзи и кристални клъстерни формирования (както Аметиста и Кварца) имат способността да абсорбират енергиите, съдържащи се в поставените върху тях кристали, да ги неутрализират и след това да излъчат „добра“енергия от друзата обратно във вече почистените кристали, така че те могат ефективно и да ги почистват, и да ги енергизират в същото време.
                    
                    За почистването на кристалите също можете да използвате окъдяването им с бял градински чай, сладка трева, сандалово и кедрово дърво, борови иглички и кора или тамян. Тази техника е особено подходяща за кристали, които не могат да бъдат накисвани в солена вода. Използвайки ветрило или просто пера за период от 3 до 7 минути се навява дима от тамяна върху кристалите. Това е особено подходяща техника, ако имате цял шкаф пълен с кристали или някои от тях са много големи и неудобни, за да им се правят бани. Опитайте се да не използвате ръката си като ветрило – тъй като, когато димът се издига, той издърпва и отнася негативните енергии от кристала, а минавайки с ръката си през този дим можете да прихванете и „попиете“ тези негативни енергии върху себе си. Не забравяйте добре да окъдите и себе си, за да изчистите вашите собствени негативни енергии, особено от ръцете, които директно работят с кристалите. Можете също да изплакнете ръцете си в солена вода, след като сте работили с кристали, както със себе си, така и с някой друг. По общо мнение кристалите най-много обичат дима от белия градински чай….
                    
                    Бърз начин за почистване на кристали е като се държат под струя хладка вода за 3-5минути. Внимание: някои кристали не трябва да се третират с вода, важи особено за меките камъни като Азурит, Ангелит, Фенакит, Селенит и др. подобни.
                   
                    Друг бърз начин за почистване на всякакви кристали е чрез поставянето им върху парче Селенит. Ако сте прочели пълното описание на Селенита, вече ще знаете, че той изобщо няма нужда да бъде почистван и има свойството да абсорбира отрицателната енергия. Освен това, селенитът почиства останалите кристали и ги презарежда! Можете просто да поставите вашия кристал за около 10 минути върху парче Селенит и сте готови! Най-добре е ако вечер поставяте кристалите, които носите през деня със себе си, върху парче Селенит, а сутрин – обратно, камъните, които сте сложили под възглавницата предната вечер (напр. Аметиста, който и без това не обича слънчевата светлина) ги оставите през деня отново върху Селенита. Така едновременно се почистват и презареждат – едните през нощта, докато спите, а другите през деня, докато си вършите ежедневните работи. Селенитът е един от най-добрите минерали за почистване и презареждане на кристалите.
                    
                    Можете да използвате и визуализацията или „своята мисловна енергия“, за да почиствате кристали. Просто дръжте кристала, фокусирайте се върху него и визуализирайте ярка бяла светлина обграждаща кристала, последвана от лъч от бяла светлина, идваща отдолу, минаваща през целия камък и отнемаща му съхранените в него енергии. Правете това, докато се почувствате щастливи от това, че бялата светлина е свършила работата си и е „отмила“ натрупаните в кристала енергии. Тази „мисловна енергия“, генерирана от вас самите, ще бъде предадена на камъка и така тя ще извърши работата по прочистването на съхранените в камъка енергии.
                    </p>
          
        </div>
       

        
            <form method="post" action="process.php">
                <label for="name" style="font-size: 22px;">Коментар:</label>
                <br>
                <textarea style=" float: rigt;
                width: 80%;
                min-width: 80%;
                min-height: 25px;
                outline: none;
                resize: none;
                " cols="5" rows="5" name="content" id="name" required>

                </textarea>
                <br>
                <br>
                <input type="submit" name="comment" value="Изпрати" style="text-decoration: none;
                color: rgba(31, 17, 17, 0.8);
                background: rgb(227, 214, 209);
                padding: 7px 4px;
                font-family: Georgia, 'Times New Roman', Times, serif;
                border-radius: 6px;
                font-weight: normal;
                text-transform: uppercase;
                margin-top: 1%;
             
                transition: all 0.2s ease-in-out;">
            </form>


            <div style="border-style:solid ;margin-top:5%;">
            <h1>Коментари..</h1>
        <?php	
                
                $con=config::connect(); 
                try
                {
                    $jb=$_SESSION['username'];  
                  
                
                    if($con)
                    {  
                        
                        $query="SELECT user,content FROM comments;";
                        $stat=$con->prepare($query);
                        $stat->execute([
                        ':user' => $jb,
                        
                        ]);
                        $comments=$stat->fetchAll(PDO::FETCH_ASSOC);
                        if($comments)
                        {
                            $counter=0;
                            foreach($comments as $comment)
                            {   
                                $counter++;
                                echo '<b style="font-size:24px">'.$counter.'</b>' . '<b style="font-size:24px">' . '.CommentBy: '. '</b>';  
                                echo '<b style="font-size:22px;">'.$comment['user'].'<b>' . '<br>';
                                echo '<b style="font-size:22px;">'.'Content:'.'</b>';
                                echo '<b style="font-size:22px;">'.$comment['content'].'</b>' . '<br>';       
                                echo '<br>'; 
                                
                            }
                       }
                    }
        
                    else
                    {
                        echo "Failed";
                    }
                }
        
                catch(PDOException $e)
                {
                    echo $e->getMessage();
                }
            
         ?>
        </div>
        
        <div >

     
        </div>
    </div>
    <footer>
        <table class="table">
            <thead>
                <tr>
                    <th scope="col" style="text-align: left;">Намерете ни</th>
                    <th scope="col" style="text-align: right;">Връзки към социални мрежи</th>
                    <th scope="col" style="text-align: center;">Полезни връзки</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <td>
                        <iframe  src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2908.212423705242!2d27.915602315278946!3d43.20503368931281!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x40a453f6081b3a81%3A0x1f83ae40851e40f3!2zNdGC0Lgg0JXQu9C10LzQtdC90YIgLSDQvNCw0LPQsNC30LjQvSDQt9CwINC60LDQvNGK0L3QuCDQuCDQvNC40L3QtdGA0LDQu9C4!5e0!3m2!1sbg!2sbg!4v1652799022830!5m2!1sbg!2sbg"  style="border:0;height: auto;width:100%;float: left;"></iframe>
                    </td>
                    <td> 
                        <a href="https://bg-bg.facebook.com/"><img src="facebook.png" > Facebook</a>
                    </td>
                    <td>
                        <a href="https://bijuta-ludigabi.com/" >Луди гъби</a>
                    </td>
                </tr>
            </tbody>
        </table>
            <p>© 2022 Crystals&&Minerals, LLC. All rights reserved.</p>
    </footer>
    </body>
    </html>